test/cassettes/location_code/quotation.yml

---
http_interactions:
- request:
    method: post
    uri: "<VERTEX_SOAP_API>CalculateTax70"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:urn="urn:vertexinc:o-series:tps:7:0"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><urn:VertexEnvelope><Login><TrustedId><VERTEX_TRUSTED_ID></TrustedId></Login><QuotationRequest
        transactionType="SALE"><LineItem lineItemNumber="1" taxDate="2018-11-30" locationCode="store_25"><Customer><Destination><StreetAddress1>11
        Wall Street</StreetAddress1><City>New York</City><MainDivision>NY</MainDivision><PostalCode>10005</PostalCode></Destination></Customer><Seller><Company>CustomInkStores</Company></Seller><Product
        productClass="53103000">4600</Product><ExtendedPrice>50.00</ExtendedPrice></LineItem></QuotationRequest></urn:VertexEnvelope></soapenv:Body></soapenv:Envelope>
    headers:
      Soapaction:
      - '"VertexEnvelope"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '855'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: ''
    headers:
      Date:
      - Fri, 06 Mar 2020 11:19:44 GMT
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '2775'
      Connection:
      - keep-alive
      Soapaction:
      - '""'
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><VertexEnvelope xmlns="urn:vertexinc:o-series:tps:7:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><Login><TrustedId></TrustedId>
        </Login>
        <QuotationResponse documentDate="2020-03-06" transactionType="SALE"><SubTotal>50.0</SubTotal>
        <Total>50.0</Total>
        <TotalTax>0.0</TotalTax>
        <LineItem lineItemNumber="1" taxDate="2018-11-30" locationCode="store_25"><Seller><Company>CustomInkStores</Company>
        </Seller>
        <Customer><Destination taxAreaId="330612010"><StreetAddress1>11 Wall Street</StreetAddress1>
        <City>New York</City>
        <MainDivision>NY</MainDivision>
        <PostalCode>10005</PostalCode>
        </Destination>
        </Customer>
        <Product productClass="53103000">4600</Product>
        <Quantity>1.0</Quantity>
        <FairMarketValue>50.0</FairMarketValue>
        <ExtendedPrice>50.0</ExtendedPrice>
        <Taxes taxResult="NO_TAX" taxType="SALES" situs="DESTINATION" notRegisteredIndicator="true" taxCollectedFromParty="BUYER"><Jurisdiction jurisdictionLevel="STATE" jurisdictionId="24354">NEW YORK</Jurisdiction>
        <CalculatedTax>0.0</CalculatedTax>
        <EffectiveRate>0.0</EffectiveRate>
        <Taxable>0.0</Taxable>
        <Imposition impositionId="1">Sales and Compensating Use Tax</Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        </Taxes>
        <Taxes taxResult="NO_TAX" taxType="SALES" situs="DESTINATION" notRegisteredIndicator="true" taxCollectedFromParty="BUYER"><Jurisdiction jurisdictionLevel="CITY" jurisdictionId="25353">NEW YORK</Jurisdiction>
        <CalculatedTax>0.0</CalculatedTax>
        <EffectiveRate>0.0</EffectiveRate>
        <Taxable>0.0</Taxable>
        <Imposition impositionId="1">Local Sales and Use Tax</Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        </Taxes>
        <Taxes taxResult="NO_TAX" taxType="SALES" situs="DESTINATION" notRegisteredIndicator="true" taxCollectedFromParty="BUYER"><Jurisdiction jurisdictionLevel="DISTRICT" jurisdictionId="79774"><![CDATA[METROPOLITAN COMMUTER TRANSPORTATION DISTRICT]]></Jurisdiction>
        <CalculatedTax>0.0</CalculatedTax>
        <EffectiveRate>0.0</EffectiveRate>
        <Taxable>0.0</Taxable>
        <Imposition impositionId="1"><![CDATA[Metropolitan Commuter Transportation District]]></Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        </Taxes>
        <TotalTax>0.0</TotalTax>
        <AssistedParameters><AssistedParameter paramName="destination.taxAreaId" phase="PRE" ruleName="Pre-Cutover Vertex Cloud Default Taxation Tax Assist Rule" originalValue="0">0</AssistedParameter>
        </AssistedParameters>
        </LineItem>
        </QuotationResponse>
        <ApplicationData><ResponseTimeMS>6.5</ResponseTimeMS>
        </ApplicationData>
        </VertexEnvelope></soapenv:Body></soapenv:Envelope>
    http_version: null
  recorded_at: Fri, 06 Mar 2020 11:19:44 GMT
recorded_with: VCR 5.1.0
